Revit 2027 API
Document.NewRoom(Phase) Method
 Creates a new unplaced room and with an assigned phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room NewRoom(
	Phase phase
)
Public Function NewRoom (
	phase As Phase
) As Room
public:
Room^ NewRoom(
	Phase^ phase
)
member NewRoom :
        phase : Phase -> Room
Parameters
phase Phase
 The phase in which the room is to exist.
Return Value
Room
 If successful the new room , otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Reference
Document Class
NewRoom Overload
Autodesk.Revit.Creation Namespace